RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/periph/PERI_LCDIFV2.h
#define LCDIFV2_INT_ENABLE_UNDERRUN_EN_MASK      (0x2U)
#define LCDIFV2_INT_ENABLE_UNDERRUN_EN_SHIFT     (1U)
/*! UNDERRUN_EN - Enable Interrupt flag to indicate the output buffer underrun condition
 *  0b0..Output buffer underrun disable
 *  0b1..Output buffer underrun enable
 */
#define LCDIFV2_INT_ENABLE_UNDERRUN_EN(x)        (((uint32_t)(((uint32_t)(x)) << LCDIFV2_INT_ENABLE_UNDERRUN_EN_SHIFT)) & LCDIFV2_INT_ENABLE_UNDERRUN_EN_MASK)

#define LCDIFV2_INT_ENABLE_VS_BLANK_EN_MASK      (0x4U)
#define LCDIFV2_INT_ENABLE_VS_BLANK_EN_SHIFT     (2U)
/*! VS_BLANK_EN - Enable Interrupt flag to indicate vertical blanking period
 *  0b0..Vertical blanking start interrupt disable
 *  0b1..Vertical blanking start interrupt enable
 */
#define LCDIFV2_INT_ENABLE_VS_BLANK_EN(x)        (((uint32_t)(((uint32_t)(x)) << LCDIFV2_INT_ENABLE_VS_BLANK_EN_SHIFT)) & LCDIFV2_INT_ENABLE_VS_BLANK_EN_MASK)

#define LCDIFV2_INT_ENABLE_DMA_ERR_EN_MASK       (0xFF00U)
#define LCDIFV2_INT_ENABLE_DMA_ERR_EN_SHIFT      (8U)
/*! DMA_ERR_EN - Enable Interrupt flag to indicate that which PLANE has Read Error on the AXI interface */
#define LCDIFV2_INT_ENABLE_DMA_ERR_EN(x)         (((uint32_t)(((uint32_t)(x)) << LCDIFV2_INT_ENABLE_DMA_ERR_EN_SHIFT)) & LCDIFV2_INT_ENABLE_DMA_ERR_EN_MASK)

#define LCDIFV2_INT_ENABLE_DMA_DONE_EN_MASK      (0xFF0000U)
#define LCDIFV2_INT_ENABLE_DMA_DONE_EN_SHIFT     (16U)
/*! DMA_DONE_EN - Enable Interrupt flag to indicate that which PLANE has fetched the last pixel from memory */
#define LCDIFV2_INT_ENABLE_DMA_DONE_EN(x)        (((uint32_t)(((uint32_t)(x)) << LCDIFV2_INT_ENABLE_DMA_DONE_EN_SHIFT)) & LCDIFV2_INT_ENABLE_DMA_DONE_EN_MASK)

#define LCDIFV2_INT_ENABLE_FIFO_EMPTY_EN_MASK    (0xFF000000U)
#define LCDIFV2_INT_ENABLE_FIFO_EMPTY_EN_SHIFT   (24U)
/*! FIFO_EMPTY_EN - Enable Interrupt flag to indicate that which FIFO in the pixel blending underflowed */
#define LCDIFV2_INT_ENABLE_FIFO_EMPTY_EN(x)      (((uint32_t)(((uint32_t)(x)) << LCDIFV2_INT_ENABLE_FIFO_EMPTY_EN_SHIFT)) & LCDIFV2_INT_ENABLE_FIFO_EMPTY_EN_MASK)
/*! @} */

/* The count of LCDIFV2_INT_ENABLE */
#define LCDIFV2_INT_ENABLE_COUNT                 (2U)

/*! @name CTRLDESCL1 - Control Descriptor Layer 1 Register */
/*! @{ */

#define LCDIFV2_CTRLDESCL1_WIDTH_MASK            (0xFFFU)
#define LCDIFV2_CTRLDESCL1_WIDTH_SHIFT           (0U)
/*! WIDTH - Width of the layer in pixels */
#define LCDIFV2_CTRLDESCL1_WIDTH(x)              (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL1_WIDTH_SHIFT)) & LCDIFV2_CTRLDESCL1_WIDTH_MASK)

#define LCDIFV2_CTRLDESCL1_HEIGHT_MASK           (0xFFF0000U)
#define LCDIFV2_CTRLDESCL1_HEIGHT_SHIFT          (16U)
/*! HEIGHT - Height of the layer in pixels */
#define LCDIFV2_CTRLDESCL1_HEIGHT(x)             (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL1_HEIGHT_SHIFT)) & LCDIFV2_CTRLDESCL1_HEIGHT_MASK)
/*! @} */

/* The count of LCDIFV2_CTRLDESCL1 */
#define LCDIFV2_CTRLDESCL1_COUNT                 (8U)

/*! @name CTRLDESCL2 - Control Descriptor Layer 2 Register */
/*! @{ */

#define LCDIFV2_CTRLDESCL2_POSX_MASK             (0xFFFU)
#define LCDIFV2_CTRLDESCL2_POSX_SHIFT            (0U)
/*! POSX - POS X */
#define LCDIFV2_CTRLDESCL2_POSX(x)               (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL2_POSX_SHIFT)) & LCDIFV2_CTRLDESCL2_POSX_MASK)

#define LCDIFV2_CTRLDESCL2_POSY_MASK             (0xFFF0000U)
#define LCDIFV2_CTRLDESCL2_POSY_SHIFT            (16U)
/*! POSY - The vertical position of top row of the layer, where 0 is the top row of the panel, only
 *    positive values are below the top row of the panel
 */
#define LCDIFV2_CTRLDESCL2_POSY(x)               (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL2_POSY_SHIFT)) & LCDIFV2_CTRLDESCL2_POSY_MASK)
/*! @} */

/* The count of LCDIFV2_CTRLDESCL2 */
#define LCDIFV2_CTRLDESCL2_COUNT                 (8U)

/*! @name CTRLDESCL3 - Control Descriptor Layer 3 Register */
/*! @{ */

#define LCDIFV2_CTRLDESCL3_PITCH_MASK            (0xFFFFU)
#define LCDIFV2_CTRLDESCL3_PITCH_SHIFT           (0U)
/*! PITCH - Number of bytes between 2 vertically adjacent pixels in system memory. Byte granularity
 *    is supported, but SW should align to 64B boundry
 */
#define LCDIFV2_CTRLDESCL3_PITCH(x)              (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL3_PITCH_SHIFT)) & LCDIFV2_CTRLDESCL3_PITCH_MASK)
/*! @} */

/* The count of LCDIFV2_CTRLDESCL3 */
#define LCDIFV2_CTRLDESCL3_COUNT                 (8U)

/*! @name CTRLDESCL4 - Control Descriptor Layer 4 Register */
/*! @{ */

#define LCDIFV2_CTRLDESCL4_ADDR_MASK             (0xFFFFFFFFU)
#define LCDIFV2_CTRLDESCL4_ADDR_SHIFT            (0U)
/*! ADDR - Address of layer data in the memory. The address programmed should be 64-bit aligned */
#define LCDIFV2_CTRLDESCL4_ADDR(x)               (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL4_ADDR_SHIFT)) & LCDIFV2_CTRLDESCL4_ADDR_MASK)
/*! @} */

/* The count of LCDIFV2_CTRLDESCL4 */
#define LCDIFV2_CTRLDESCL4_COUNT                 (8U)

/*! @name CTRLDESCL5 - Control Descriptor Layer 5 Register */
/*! @{ */

#define LCDIFV2_CTRLDESCL5_AB_MODE_MASK          (0x3U)
#define LCDIFV2_CTRLDESCL5_AB_MODE_SHIFT         (0U)
/*! AB_MODE - Alpha Blending Mode
 *  0b00..No alpha Blending (The SAFETY_EN bit need set to 1)
 *  0b01..Blend with global ALPHA
 *  0b10..Blend with embedded ALPHA
 *  0b11..Blend with Porter Duff enable
 */
#define LCDIFV2_CTRLDESCL5_AB_MODE(x)            (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL5_AB_MODE_SHIFT)) & LCDIFV2_CTRLDESCL5_AB_MODE_MASK)

#define LCDIFV2_CTRLDESCL5_PD_FACTOR_MODE_MASK   (0x30U)
#define LCDIFV2_CTRLDESCL5_PD_FACTOR_MODE_SHIFT  (4U)
/*! PD_FACTOR_MODE - Porter Duff factor mode
 *  0b00..Using 1
 *  0b01..Using 0
 *  0b10..Using straight alpha
 *  0b11..Using inverse alpha
 */
#define LCDIFV2_CTRLDESCL5_PD_FACTOR_MODE(x)     (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL5_PD_FACTOR_MODE_SHIFT)) & LCDIFV2_CTRLDESCL5_PD_FACTOR_MODE_MASK)

#define LCDIFV2_CTRLDESCL5_PD_GLOBAL_ALPHA_MODE_MASK (0xC0U)
#define LCDIFV2_CTRLDESCL5_PD_GLOBAL_ALPHA_MODE_SHIFT (6U)
/*! PD_GLOBAL_ALPHA_MODE - Porter Duff global alpha mode
 *  0b00..Using global alpha
 *  0b01..Using local alpha
 *  0b10..Using scaled alpha
 *  0b11..Using scaled alpha
 */
#define LCDIFV2_CTRLDESCL5_PD_GLOBAL_ALPHA_MODE(x) (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL5_PD_GLOBAL_ALPHA_MODE_SHIFT)) & LCDIFV2_CTRLDESCL5_PD_GLOBAL_ALPHA_MODE_MASK)

#define LCDIFV2_CTRLDESCL5_PD_ALPHA_MODE_MASK    (0x100U)
#define LCDIFV2_CTRLDESCL5_PD_ALPHA_MODE_SHIFT   (8U)
/*! PD_ALPHA_MODE - Porter Duff alpha mode
 *  0b0..Straight mode for Porter Duff alpha
 *  0b1..Inversed mode for Porter Duff alpha
 */
#define LCDIFV2_CTRLDESCL5_PD_ALPHA_MODE(x)      (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL5_PD_ALPHA_MODE_SHIFT)) & LCDIFV2_CTRLDESCL5_PD_ALPHA_MODE_MASK)

#define LCDIFV2_CTRLDESCL5_PD_COLOR_MODE_MASK    (0x200U)
#define LCDIFV2_CTRLDESCL5_PD_COLOR_MODE_SHIFT   (9U)
/*! PD_COLOR_MODE - Porter Duff alpha mode
 *  0b0..Straight mode for Porter Duff color
 *  0b1..Inversed mode for Porter Duff color
 */
#define LCDIFV2_CTRLDESCL5_PD_COLOR_MODE(x)      (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL5_PD_COLOR_MODE_SHIFT)) & LCDIFV2_CTRLDESCL5_PD_COLOR_MODE_MASK)

#define LCDIFV2_CTRLDESCL5_YUV_FORMAT_MASK       (0xC000U)
#define LCDIFV2_CTRLDESCL5_YUV_FORMAT_SHIFT      (14U)
/*! YUV_FORMAT - The YUV422 input format selection
 *  0b00..The YVYU422 8bit sequence is U1,Y1,V1,Y2
 *  0b01..The YVYU422 8bit sequence is V1,Y1,U1,Y2
 *  0b10..The YVYU422 8bit sequence is Y1,U1,Y2,V1
 *  0b11..The YVYU422 8bit sequence is Y1,V1,Y2,U1
 */
#define LCDIFV2_CTRLDESCL5_YUV_FORMAT(x)         (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL5_YUV_FORMAT_SHIFT)) & LCDIFV2_CTRLDESCL5_YUV_FORMAT_MASK)

